---
kind: type
id: T:Autodesk.Revit.UI.Events.ComboBoxDropDownOpenedEventArgs
source: html/2e97a182-2f96-bc29-ac2b-529f8938043c.htm
---
# Autodesk.Revit.UI.Events.ComboBoxDropDownOpenedEventArgs

The event arguments used by ComboBox's DropDownOpened event.

## Syntax (C#)
```csharp
public class ComboBoxDropDownOpenedEventArgs : RibbonItemEventArgs
```